{
    "description": "I'm a data scientist / machine learning engineer with a background in computational / quantum physics. I write loads of python and typescript, and a little bit of everything else.\nI like working on hard R&D problems involving computer vision, natural language processing, graph theory, representation learning, recommendation systems, and information retrieval.\nI love turning those research projects into end-to-end pipelines and services which help people in the real world.",
    "experience": [
        {
            "organisation": "Climate Policy Radar",
            "roles": [
                {
                    "title": "Senior Data Scientist",
                    "start-date": "2023",
                    "description": "Building a search engine, knowledge graph, and ML models for climate policy documents"
                }
            ]
        },
        {
            "organisation": "Wellcome",
            "roles": [
                {
                    "title": "Senior Data Scientist",
                    "start-date": "2022",
                    "end-date": "2023",
                    "description": "Building the next generation of search and discovery on wellcomecollection.org, including experiments with knowledge graphs, multi-modal search, and semantic search"
                },
                {
                    "title": "Data Scientist",
                    "start-date": "2018",
                    "end-date": "2021",
                    "description": "Prototyping and productionising computer vision pipelines, novel NLP models, and core search algorithms to help researchers find things on wellcomecollection.org."
                }
            ]
        },
        {
            "organisation": "The British Museum",
            "roles": [
                {
                    "title": "Data Analyst",
                    "start-date": "2016",
                    "end-date": "2018",
                    "description": "Produced ML-heavy analyses of huge datasets, distilling visitors' motivations, expectations, and needs when visiting the museum online and IRL."
                }
            ]
        },
        {
            "organisation": "Great Little Place",
            "roles": [
                {
                    "title": "Data Science Intern",
                    "start-date": "2015",
                    "end-date": "2015",
                    "description": "Built a matching/recommendation system for an app with hundreds of thousands of users around the world."
                }
            ]
        }
    ],
    "education": [
        {
            "institution": "University College London (UCL)",
            "degree": "MSci Physics",
            "grade": "2:1",
            "start-date": "2012",
            "end-date": "2016",
            "description": "Thesis: Correlations between water fragments on silicon"
        }
    ],
    "skills": {
        "machine learning": [
            "pytorch",
            "scikit-learn",
            "tensorflow",
            "wandb"
        ],
        "data science": [
            "jupyter",
            "pandas",
            "numpy",
            "scipy",
            "matplotlib",
            "spacy",
            "neo4j",
            "networkx",
            "elasticsearch",
            "pyspark",
            "SQL"
        ],
        "web development": [
            "typescript",
            "javascript",
            "node.js",
            "react",
            "next.js",
            "tailwind",
            "graphql",
            "jest",
            "playwright",
            "fastapi",
            "flask"
        ],
        "deployment": [
            "AWS",
            "terraform",
            "docker",
            "git",
            "github actions",
            "vercel",
            "netlify",
            "heroku",
            "supabase"
        ]
    },
    "other": {
        "teaching and mentoring": "I try to share what I've learned through blog posts, reusable code, and/or talks at conferences and universities.\nI've also mentored and advised first-time conference speakers, artists, researchers in industry and academia, grant funding applicants, and students all the way from GCSE to PhD.",
        "open source software development": "I've built a lot of open source tools, sites, and services outside of work to sharpen my own development skills and experiment with new technologies.",
        "cycling and outdoor swimming": "I like swimming outdoors, especially through the winter. I've been cycling in London for ten years and I've only been hit by four cabs."
    }
}
